gyeongminbag27-arch/axi-spi-uart-timer-gpio-soc/firmware/stm32_f446re/device_driver.h
#include "stm32f4xx.h"
#include "option.h"
#include "macro.h"
#include "malloc.h"

// Uart.c

extern void Uart2_Init(int baud);
extern void Uart2_Send_Byte(char data);
extern void Uart2_RX_Interrupt_Enable(int en);

extern void Uart1_Init(int baud);
extern void Uart1_Send_Byte(char data);
extern void Uart1_Send_String(char *pt);
extern void Uart1_Printf(char *fmt,...);
extern char Uart1_Get_Char(void);
extern char Uart1_Get_Pressed(void);

// SysTick.c

extern void SysTick_Run(unsigned int msec);
extern int SysTick_Check_Timeout(void);
extern unsigned int SysTick_Get_Time(void);
extern unsigned int SysTick_Get_Load_Time(void);
extern void SysTick_Stop(void);

// Led.c

extern void LED_Init(void);
extern void LED_On(void);
extern void LED_Off(void);

// Clock.c

extern void Clock_Init(void);

// Key.c

extern void Key_Poll_Init(void);
extern int Key_Get_Pressed(void);

extern void Key_Wait_Key_Released(void);
extern void Key_Wait_Key_Pressed(void);
extern void Key_ISR_Enable(int en);

// keypad_4x4
extern void Keypad_Init(void);
extern char Keypad_Get_Key(void);

// Timer.c

extern void TIM2_Delay(int time);
extern void TIM2_Stopwatch_Start(void);
extern unsigned int TIM2_Stopwatch_Stop(void);
extern void TIM4_Repeat(int time);
extern int TIM4_Check_Timeout(void);
extern void TIM4_Stop(void);
extern void TIM4_Change_Value(int time);
extern void TIM4_Repeat_Interrupt_Enable(int en, int time);
extern void TIM3_Out_Init(void);
extern void TIM3_Out_Freq_Generation(unsigned short freq);
extern void TIM3_Out_Stop(void);


// motor.c

extern void Motor_Init(void);
extern void Motor_Step(int direction);
extern void Motor_Stop(void);


// buzzer.c
extern void Buzzer_Play_Melody(void);

// Oled.c

extern void I2C1_Init(void);
extern void OLED_Init(void);
extern void OLED_Clear(void);
extern void OLED_Fill(unsigned char data);
extern void OLED_Print(unsigned char page,
                       unsigned char column,
                       const char *str);

extern void OLED_Write_Char(unsigned char page,
                            unsigned char column,
                            char ch);
// oled_font.c

extern const unsigned char Font5x7[][5];